**** Shell scripts
#+PROPERTY: header-args :results none
#+BEGIN_SRC emacs-lisp :tangle ~/.config/doom/config.el


(use-package! apheleia
  :config
  (apheleia-global-mode 1)

  (setf (alist-get 'shfmt apheleia-formatters)
        '("shfmt" "-i" "2" "-ci" "-ln=zsh"))

  (setf (alist-get 'sh-mode apheleia-mode-alist)
        'shfmt)

  (defun my/format-org-src-blocks-with-apheleia ()
    "Format source blocks in Org using Apheleia."
    (when (eq major-mode 'org-mode)
      (org-element-map (org-element-parse-buffer) 'src-block
        (lambda (src-block)
          (let* ((lang (org-element-property :language src-block))
                 (beg (org-element-property :begin src-block)))
            (when (assoc (intern lang) apheleia-mode-alist)
              (save-excursion
                (goto-char beg)
                (org-edit-special)
                (when (apheleia--buffer-supported-p)
                  (apheleia-format-buffer))
                (org-edit-src-exit))))))))

  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'before-save-hook
                        #'my/format-org-src-blocks-with-apheleia
                        nil t))))

(defun elsanchez/disable-apheleia-for-zshrc ()
  (when (and buffer-file-name
             (string-match-p "\\.zshrc\\'" buffer-file-name))
    (apheleia-mode -1)))

(defun my/org-babel-format-on-save ()
  "Auto-indent org babel blocks on save."
  (when (derived-mode-p 'org-mode)
    (org-babel-map-src-blocks nil
      (let* ((info (org-babel-get-src-block-info t))
             (lang (nth 0 info)))
        (when (member lang '("emacs-lisp" "sh" "bash" "zsh" "python" "elisp"))
          (save-excursion
            (org-babel-do-key-sequence-in-edit-buffer (kbd "C-c '"))
            (when (fboundp 'eglot-format-buffer)
              (eglot-format-buffer))
            (org-edit-src-exit)))))))

(add-hook 'before-save-hook #'my/org-babel-format-on-save)

(add-hook 'sh-mode-hook #'elsanchez/disable-apheleia-for-zshrc)

(defun my/org-babel-format-src-blocks ()
  "Format all source blocks in the current org buffer."
  (interactive)
  (org-babel-map-src-blocks nil
    (let* ((info (org-babel-get-src-block-info t))
           (lang (nth 0 info)))
      (when (member lang '("sh" "bash" "zsh" "emacs-lisp" "python"))
        (let ((edit-buffer (org-edit-src-code)))
          (with-current-buffer edit-buffer
            (indent-region (point-min) (point-max)))
          (org-edit-src-exit))))))

(add-hook 'before-save-hook
          (lambda ()
            (when (derived-mode-p 'org-mode)
              (my/org-babel-format-src-blocks))))


#+END_SRC

#+RESULTS:
| elsanchez/disable-apheleia-for-zshrc | evil-collection-sh-script-set-evil-shift-width | rainbow-delimiters-mode | +sh-init-extra-fontification-h | +lookup--init-sh-mode-handlers-h | +electric--init-sh-mode-h | sh-electric-here-document-mode |


**** Clean up workspaces on startup
#+PROPERTY: header-args :results none
#+BEGIN_SRC emacs-lisp :tangle ~/.config/doom/config.el
(setq treemacs-position 'right)  ; Abre en el lado derecho

(after! projectile
  (add-hook 'projectile-after-switch-project-hook #'treemacs-add-and-display-current-project-exclusively))

(defun elsanchez/cleanup-workspaces-on-startup ()
  "Delete all extra workspaces if Emacs started without files."
  (when (and (bound-and-true-p persp-mode)
             (= (length (persp-names)) 1) ;; Only *scratch* or *doom*
             (get-buffer "*doom*"))
    (+workspace/delete-other)))

(add-hook 'emacs-startup-hook #'elsanchez/cleanup-workspaces-on-startup)
#+END_SRC

#+RESULTS:
| elsanchez/cleanup-workspaces-on-startup |

